Table of Contents
 Class MaterialBoltGrade
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Material bolt grade
[OpenModelClass("CI.StructModel.Libraries.Material.MaterialBoltGrade,CI.Material", "CI.StructModel.Libraries.Material.IMatBoltGrade,CI.BasicTypes", typeof(Material))]
public class MaterialBoltGrade : Material
Inheritance
object
OpenObject
OpenElementId
Material
MaterialBoltGrade
Derived
MaterialBoltGradeHKG
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Code
Design code
public CountryCode Code { get; set; }
Property Value
CountryCode
 Elongation
Elongation after fracture - for 20% elongation use value 0.2
public double Elongation { get; set; }
Property Value
double
 MprlElementID
Name fo the bolt grade in MPRL database
public Guid MprlElementID { get; set; }
Property Value
Guid
 MprlTableID
Unique ID of MPRL database table where the bolt grade was taken from.
public Guid MprlTableID { get; set; }
Property Value
Guid
 fub
Ultimate tensile strength
public double fub { get; set; }
Property Value
double
 fyb
Yield strength
public double fyb { get; set; }
Property Value
double
 Edit this page